app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at", "kontakt") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "ddasdasdasdasdasdasdasdas"], ["user_id", 1], ["created_at", "2018-08-18 16:12:37.376527"], ["updated_at", "2018-08-18 16:12:37.376527"], ["kontakt", "hhhhh231423"]]
---
  def create
    redirect_to root_path unless logged_in?
    @post = Post.new(
        user_id: current_user.id,
        content: params[:post][:content],
        kontakt: params[:post][:kontakt])
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 10]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy